import React from 'react';
import { TextScroll } from '@td-design/lego';

export default () => {
  return (
    <div
      style={{
        width: 429,
        height: 187,
        backgroundImage: `url(${require('../assets/border_bg.png')})`,
        padding: 20,
        backgroundSize: '100% 100%',
      }}
    >
      <TextScroll
        contentStyle={{ height: 187 }}
        listStyle={{ animation: 'scroll 8s 2s linear infinite' }}
        texts={[
          '雷数科技竭力为客户提供贯穿整个设备生命周期的全方位服务，经过十几年变迁与发展，销售累计突破百亿。雷数科技竭力为客户提供贯穿整个设备生命周期的全方位服务，经过十几年变迁与发展，销售累计突破百亿。雷数科技竭力为客户提供贯穿整个设备生命周期的全方位服务，经过十几年变迁与发展，销售累计突破百亿。雷数科技竭力为客户提供贯穿整个设备生命周期的全方位服务，经过十几年变迁与发展，销售累计突破百亿。',
          '今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦今天是个好日子哦',
          '明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦明天是个好日子哦',
        ]}
      />
    </div>
  );
};
